seasons_months_list = ['заглушка', 'зима', 'зима', 'весна', 'весна', 'весна',
                       'лето', 'лето', 'лето', 'осень', 'осень', 'осень', 'зима']
seasons_months_dictionary = {
    1: 'зима',
    2: 'зима',
    3: 'весна',
    4: 'весна',
    5: 'весна',
    6: 'лето',
    7: 'лето',
    8: 'лето',
    9: 'осень',
    10: 'осень',
    11: 'осень',
    12: 'зима',
}
month = int(input('Введите номер месяца(1-12): '))
print(f'"{seasons_months_dictionary[month]}"(поиск по славарю)')
print(f'"{seasons_months_list[month]}"(поиск по списку)')
